app/controllers/courses_controller.rb

  def create
    @course = Course.new(course_params)
    if @course.save
---
INSERT INTO "courses" ("name", "description", "credits", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", "aiueo"], ["description", "aiueo"], ["credits", 7], ["created_at", "2024-10-07 07:17:24.274117"], ["updated_at", "2024-10-07 07:17:24.274117"]]