app/controllers/lectures_controller.rb

SELECT "lectures".* FROM "lectures" WHERE "lectures"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show
        @lecture = Lecture.find(params[:id])